ci4_att/app/Controllers/HotelesController.php

SELECT *
FROM `hoteles`
---
    public function index(): string
    {
        $hoteles = new HotelesModel();
        $datos ['datos']=$hoteles->findAll();